# wsEditAddTool2

## Description
Add a menu under Third-party palette and companyName tool set. The menu is added underneath another existing tool in the tool set.

```pascal
PROCEDURE wsEditAddTool2(
				toolName      : STRING;
				underToolName : STRING;
				toolType      : INTEGER);
```

```python

def vs.wsEditAddTool2(toolName, underToolName, toolType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolName|STRING||
|underToolName|STRING||
|toolType|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Workspaces